# IFCFileWriteOptions Class

---
This class contains options to write an IFC file.
SystemObject Autodesk.Revit.DB.IFCIFCFileWriteOptions
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

    public class IFCFileWriteOptions : IDisposable

    Public Class IFCFileWriteOptions
    	Implements IDisposable

    public ref class IFCFileWriteOptions : IDisposable

    type IFCFileWriteOptions =
        class
            interface IDisposable
        end
The IFCFileWriteOptions type exposes the following members.
| Name| Description
---|---|---
| IFCFileWriteOptions|  Creates a default IFCFileWriteOptions. The default file format is ifc.
Top
| Name| Description
---|---|---
| FileFormat|  The file format of the IFC file.
| FileName|  The full file name of the IFC file to be written.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the IFCFileWriteOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.IFC Namespace